Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickSkipCountChangedEventArgs
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickSkipCountChangedEventArgs class provides the event arguments for a skip count change.
System.EventArgs

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickSkipCountChangedEventArgs.#ctor(System.Int32,System.Boolean)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickSkipCountChangedEventArgs class.
skipCount: The skip count.
increased: A value indicating whether the skip count has been increased; or otherwise, decreased.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickSkipCountChangedEventArgs.#ctor(Tekla.BIM.DirectManipulation.Services.Picking.PickSkipCountChangedEventArgs)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickSkipCountChangedEventArgs class.
eventArgs: The Tekla.BIM.DirectManipulation.Services.Picking.PickSkipCountChangedEventArgs instance containing the event data.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickSkipCountChangedEventArgs.Decreased
Gets a value indicating whether the skip count has decreased.
If false, the skip count has Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickSkipCountChangedEventArgs.Increased.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickSkipCountChangedEventArgs.Increased
Gets a value indicating whether the skip count has increased.
If false, the skip count has Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickSkipCountChangedEventArgs.Decreased.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickSkipCountChangedEventArgs.SkipCount
Gets the skip count.